zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_QUADSPI.h
#define QuadSPI_TGIPCRS_ARB_LOCK_MASK            (0x200000U)
#define QuadSPI_TGIPCRS_ARB_LOCK_SHIFT           (21U)
#define QuadSPI_TGIPCRS_ARB_LOCK_WIDTH           (1U)
#define QuadSPI_TGIPCRS_ARB_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_ARB_LOCK_SHIFT)) & QuadSPI_TGIPCRS_ARB_LOCK_MASK)

#define QuadSPI_TGIPCRS_ARB_UNLOCK_MASK          (0x400000U)
#define QuadSPI_TGIPCRS_ARB_UNLOCK_SHIFT         (22U)
#define QuadSPI_TGIPCRS_ARB_UNLOCK_WIDTH         (1U)
#define QuadSPI_TGIPCRS_ARB_UNLOCK(x)            (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_ARB_UNLOCK_SHIFT)) & QuadSPI_TGIPCRS_ARB_UNLOCK_MASK)

#define QuadSPI_TGIPCRS_CLR_MASK                 (0x10000000U)
#define QuadSPI_TGIPCRS_CLR_SHIFT                (28U)
#define QuadSPI_TGIPCRS_CLR_WIDTH                (1U)
#define QuadSPI_TGIPCRS_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_CLR_SHIFT)) & QuadSPI_TGIPCRS_CLR_MASK)

#define QuadSPI_TGIPCRS_ERR_MASK                 (0x60000000U)
#define QuadSPI_TGIPCRS_ERR_SHIFT                (29U)
#define QuadSPI_TGIPCRS_ERR_WIDTH                (2U)
#define QuadSPI_TGIPCRS_ERR(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_ERR_SHIFT)) & QuadSPI_TGIPCRS_ERR_MASK)

#define QuadSPI_TGIPCRS_VLD_MASK                 (0x80000000U)
#define QuadSPI_TGIPCRS_VLD_SHIFT                (31U)
#define QuadSPI_TGIPCRS_VLD_WIDTH                (1U)
#define QuadSPI_TGIPCRS_VLD(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_TGIPCRS_VLD_SHIFT)) & QuadSPI_TGIPCRS_VLD_MASK)
/*! @} */

/*! @name MGC - Master Global Configuration */
/*! @{ */

#define QuadSPI_MGC_GCLCKMID_MASK                (0x3FU)
#define QuadSPI_MGC_GCLCKMID_SHIFT               (0U)
#define QuadSPI_MGC_GCLCKMID_WIDTH               (6U)
#define QuadSPI_MGC_GCLCKMID(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_MGC_GCLCKMID_SHIFT)) & QuadSPI_MGC_GCLCKMID_MASK)

#define QuadSPI_MGC_GCLCK_MASK                   (0xC00U)
#define QuadSPI_MGC_GCLCK_SHIFT                  (10U)
#define QuadSPI_MGC_GCLCK_WIDTH                  (2U)
#define QuadSPI_MGC_GCLCK(x)                     (((uint32_t)(((uint32_t)(x)) << QuadSPI_MGC_GCLCK_SHIFT)) & QuadSPI_MGC_GCLCK_MASK)

#define QuadSPI_MGC_GVLDFRAD_MASK                (0x8000000U)
#define QuadSPI_MGC_GVLDFRAD_SHIFT               (27U)
#define QuadSPI_MGC_GVLDFRAD_WIDTH               (1U)
#define QuadSPI_MGC_GVLDFRAD(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_MGC_GVLDFRAD_SHIFT)) & QuadSPI_MGC_GVLDFRAD_MASK)

#define QuadSPI_MGC_GVLDMDAD_MASK                (0x20000000U)
#define QuadSPI_MGC_GVLDMDAD_SHIFT               (29U)
#define QuadSPI_MGC_GVLDMDAD_WIDTH               (1U)
#define QuadSPI_MGC_GVLDMDAD(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_MGC_GVLDMDAD_SHIFT)) & QuadSPI_MGC_GVLDMDAD_MASK)

#define QuadSPI_MGC_GVLD_MASK                    (0x80000000U)
#define QuadSPI_MGC_GVLD_SHIFT                   (31U)
#define QuadSPI_MGC_GVLD_WIDTH                   (1U)
#define QuadSPI_MGC_GVLD(x)                      (((uint32_t)(((uint32_t)(x)) << QuadSPI_MGC_GVLD_SHIFT)) & QuadSPI_MGC_GVLD_MASK)
/*! @} */

/*! @name MRC - Master Read Command */
/*! @{ */

#define QuadSPI_MRC_READ_CMD0_MASK               (0x3FU)
#define QuadSPI_MRC_READ_CMD0_SHIFT              (0U)
#define QuadSPI_MRC_READ_CMD0_WIDTH              (6U)
#define QuadSPI_MRC_READ_CMD0(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_MRC_READ_CMD0_SHIFT)) & QuadSPI_MRC_READ_CMD0_MASK)

#define QuadSPI_MRC_READ_CMD1_MASK               (0x3F00U)
#define QuadSPI_MRC_READ_CMD1_SHIFT              (8U)
#define QuadSPI_MRC_READ_CMD1_WIDTH              (6U)
#define QuadSPI_MRC_READ_CMD1(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_MRC_READ_CMD1_SHIFT)) & QuadSPI_MRC_READ_CMD1_MASK)

#define QuadSPI_MRC_READ_CMD2_MASK               (0x3F0000U)
#define QuadSPI_MRC_READ_CMD2_SHIFT              (16U)
#define QuadSPI_MRC_READ_CMD2_WIDTH              (6U)
#define QuadSPI_MRC_READ_CMD2(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_MRC_READ_CMD2_SHIFT)) & QuadSPI_MRC_READ_CMD2_MASK)

#define QuadSPI_MRC_VLDCMD02_MASK                (0x400000U)
#define QuadSPI_MRC_VLDCMD02_SHIFT               (22U)
#define QuadSPI_MRC_VLDCMD02_WIDTH               (1U)
#define QuadSPI_MRC_VLDCMD02(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_MRC_VLDCMD02_SHIFT)) & QuadSPI_MRC_VLDCMD02_MASK)

#define QuadSPI_MRC_READ_CMD3_MASK               (0x3F000000U)
#define QuadSPI_MRC_READ_CMD3_SHIFT              (24U)
#define QuadSPI_MRC_READ_CMD3_WIDTH              (6U)
#define QuadSPI_MRC_READ_CMD3(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_MRC_READ_CMD3_SHIFT)) & QuadSPI_MRC_READ_CMD3_MASK)

#define QuadSPI_MRC_VLDCMD03_MASK                (0x40000000U)
#define QuadSPI_MRC_VLDCMD03_SHIFT               (30U)
#define QuadSPI_MRC_VLDCMD03_WIDTH               (1U)
#define QuadSPI_MRC_VLDCMD03(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_MRC_VLDCMD03_SHIFT)) & QuadSPI_MRC_VLDCMD03_MASK)
/*! @} */

/*! @name MTO - Master Timeout */
/*! @{ */

#define QuadSPI_MTO_WRITE_TO_MASK                (0xFFFFFFFFU)
#define QuadSPI_MTO_WRITE_TO_SHIFT               (0U)
#define QuadSPI_MTO_WRITE_TO_WIDTH               (32U)
#define QuadSPI_MTO_WRITE_TO(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_MTO_WRITE_TO_SHIFT)) & QuadSPI_MTO_WRITE_TO_MASK)
/*! @} */

/*! @name FLSEQREQ - FlashSeq Request */
/*! @{ */

#define QuadSPI_FLSEQREQ_REQ_MID_MASK            (0x3FU)
#define QuadSPI_FLSEQREQ_REQ_MID_SHIFT           (0U)
#define QuadSPI_FLSEQREQ_REQ_MID_WIDTH           (6U)
#define QuadSPI_FLSEQREQ_REQ_MID(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_REQ_MID_SHIFT)) & QuadSPI_FLSEQREQ_REQ_MID_MASK)

#define QuadSPI_FLSEQREQ_REQ_TG_MASK             (0x40U)
#define QuadSPI_FLSEQREQ_REQ_TG_SHIFT            (6U)
#define QuadSPI_FLSEQREQ_REQ_TG_WIDTH            (1U)
#define QuadSPI_FLSEQREQ_REQ_TG(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_REQ_TG_SHIFT)) & QuadSPI_FLSEQREQ_REQ_TG_MASK)

