zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_QUADSPI.h
#define QuadSPI_FLSEQREQ_SA_MASK                 (0x100U)
#define QuadSPI_FLSEQREQ_SA_SHIFT                (8U)
#define QuadSPI_FLSEQREQ_SA_WIDTH                (1U)
#define QuadSPI_FLSEQREQ_SA(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_SA_SHIFT)) & QuadSPI_FLSEQREQ_SA_MASK)

#define QuadSPI_FLSEQREQ_PA_MASK                 (0x200U)
#define QuadSPI_FLSEQREQ_PA_SHIFT                (9U)
#define QuadSPI_FLSEQREQ_PA_WIDTH                (1U)
#define QuadSPI_FLSEQREQ_PA(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_PA_SHIFT)) & QuadSPI_FLSEQREQ_PA_MASK)

#define QuadSPI_FLSEQREQ_ARB_LOCK_MASK           (0x400U)
#define QuadSPI_FLSEQREQ_ARB_LOCK_SHIFT          (10U)
#define QuadSPI_FLSEQREQ_ARB_LOCK_WIDTH          (1U)
#define QuadSPI_FLSEQREQ_ARB_LOCK(x)             (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_ARB_LOCK_SHIFT)) & QuadSPI_FLSEQREQ_ARB_LOCK_MASK)

#define QuadSPI_FLSEQREQ_FRAD_MASK               (0x7000U)
#define QuadSPI_FLSEQREQ_FRAD_SHIFT              (12U)
#define QuadSPI_FLSEQREQ_FRAD_WIDTH              (3U)
#define QuadSPI_FLSEQREQ_FRAD(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_FRAD_SHIFT)) & QuadSPI_FLSEQREQ_FRAD_MASK)

#define QuadSPI_FLSEQREQ_SEQID_MASK              (0xF0000U)
#define QuadSPI_FLSEQREQ_SEQID_SHIFT             (16U)
#define QuadSPI_FLSEQREQ_SEQID_WIDTH             (4U)
#define QuadSPI_FLSEQREQ_SEQID(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_SEQID_SHIFT)) & QuadSPI_FLSEQREQ_SEQID_MASK)

#define QuadSPI_FLSEQREQ_CMD_MASK                (0x400000U)
#define QuadSPI_FLSEQREQ_CMD_SHIFT               (22U)
#define QuadSPI_FLSEQREQ_CMD_WIDTH               (1U)
#define QuadSPI_FLSEQREQ_CMD(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_CMD_SHIFT)) & QuadSPI_FLSEQREQ_CMD_MASK)

#define QuadSPI_FLSEQREQ_TIMEOUT_MASK            (0x8000000U)
#define QuadSPI_FLSEQREQ_TIMEOUT_SHIFT           (27U)
#define QuadSPI_FLSEQREQ_TIMEOUT_WIDTH           (1U)
#define QuadSPI_FLSEQREQ_TIMEOUT(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_TIMEOUT_SHIFT)) & QuadSPI_FLSEQREQ_TIMEOUT_MASK)

#define QuadSPI_FLSEQREQ_CLR_MASK                (0x20000000U)
#define QuadSPI_FLSEQREQ_CLR_SHIFT               (29U)
#define QuadSPI_FLSEQREQ_CLR_WIDTH               (1U)
#define QuadSPI_FLSEQREQ_CLR(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_CLR_SHIFT)) & QuadSPI_FLSEQREQ_CLR_MASK)

#define QuadSPI_FLSEQREQ_VLD_MASK                (0x80000000U)
#define QuadSPI_FLSEQREQ_VLD_SHIFT               (31U)
#define QuadSPI_FLSEQREQ_VLD_WIDTH               (1U)
#define QuadSPI_FLSEQREQ_VLD(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSEQREQ_VLD_SHIFT)) & QuadSPI_FLSEQREQ_VLD_MASK)
/*! @} */

/*! @name FSMSTAT - FSM Status */
/*! @{ */

#define QuadSPI_FSMSTAT_STATE_MASK               (0x3U)
#define QuadSPI_FSMSTAT_STATE_SHIFT              (0U)
#define QuadSPI_FSMSTAT_STATE_WIDTH              (2U)
#define QuadSPI_FSMSTAT_STATE(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_FSMSTAT_STATE_SHIFT)) & QuadSPI_FSMSTAT_STATE_MASK)

#define QuadSPI_FSMSTAT_MID_MASK                 (0x3F00U)
#define QuadSPI_FSMSTAT_MID_SHIFT                (8U)
#define QuadSPI_FSMSTAT_MID_WIDTH                (6U)
#define QuadSPI_FSMSTAT_MID(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_FSMSTAT_MID_SHIFT)) & QuadSPI_FSMSTAT_MID_MASK)

#define QuadSPI_FSMSTAT_CMD_MASK                 (0x10000U)
#define QuadSPI_FSMSTAT_CMD_SHIFT                (16U)
#define QuadSPI_FSMSTAT_CMD_WIDTH                (1U)
#define QuadSPI_FSMSTAT_CMD(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_FSMSTAT_CMD_SHIFT)) & QuadSPI_FSMSTAT_CMD_MASK)

#define QuadSPI_FSMSTAT_ARB_LOCK_MASK            (0x20000U)
#define QuadSPI_FSMSTAT_ARB_LOCK_SHIFT           (17U)
#define QuadSPI_FSMSTAT_ARB_LOCK_WIDTH           (1U)
#define QuadSPI_FSMSTAT_ARB_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_FSMSTAT_ARB_LOCK_SHIFT)) & QuadSPI_FSMSTAT_ARB_LOCK_MASK)

#define QuadSPI_FSMSTAT_VLD_MASK                 (0x80000000U)
#define QuadSPI_FSMSTAT_VLD_SHIFT                (31U)
#define QuadSPI_FSMSTAT_VLD_WIDTH                (1U)
#define QuadSPI_FSMSTAT_VLD(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_FSMSTAT_VLD_SHIFT)) & QuadSPI_FSMSTAT_VLD_MASK)
/*! @} */

/*! @name IPSERROR - IPS Error */
/*! @{ */

#define QuadSPI_IPSERROR_MID_MASK                (0x3FU)
#define QuadSPI_IPSERROR_MID_SHIFT               (0U)
#define QuadSPI_IPSERROR_MID_WIDTH               (6U)
#define QuadSPI_IPSERROR_MID(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_MID_SHIFT)) & QuadSPI_IPSERROR_MID_MASK)

#define QuadSPI_IPSERROR_TG0LCK_MASK             (0x100U)
#define QuadSPI_IPSERROR_TG0LCK_SHIFT            (8U)
#define QuadSPI_IPSERROR_TG0LCK_WIDTH            (1U)
#define QuadSPI_IPSERROR_TG0LCK(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_TG0LCK_SHIFT)) & QuadSPI_IPSERROR_TG0LCK_MASK)

#define QuadSPI_IPSERROR_TG1LCK_MASK             (0x200U)
#define QuadSPI_IPSERROR_TG1LCK_SHIFT            (9U)
#define QuadSPI_IPSERROR_TG1LCK_WIDTH            (1U)
#define QuadSPI_IPSERROR_TG1LCK(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_TG1LCK_SHIFT)) & QuadSPI_IPSERROR_TG1LCK_MASK)

#define QuadSPI_IPSERROR_TG0SEC_MASK             (0x400U)
#define QuadSPI_IPSERROR_TG0SEC_SHIFT            (10U)
#define QuadSPI_IPSERROR_TG0SEC_WIDTH            (1U)
#define QuadSPI_IPSERROR_TG0SEC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_TG0SEC_SHIFT)) & QuadSPI_IPSERROR_TG0SEC_MASK)

#define QuadSPI_IPSERROR_TG1SEC_MASK             (0x800U)
#define QuadSPI_IPSERROR_TG1SEC_SHIFT            (11U)
#define QuadSPI_IPSERROR_TG1SEC_WIDTH            (1U)
#define QuadSPI_IPSERROR_TG1SEC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_TG1SEC_SHIFT)) & QuadSPI_IPSERROR_TG1SEC_MASK)

#define QuadSPI_IPSERROR_TG0MID_MASK             (0x1000U)
#define QuadSPI_IPSERROR_TG0MID_SHIFT            (12U)
#define QuadSPI_IPSERROR_TG0MID_WIDTH            (1U)
#define QuadSPI_IPSERROR_TG0MID(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_TG0MID_SHIFT)) & QuadSPI_IPSERROR_TG0MID_MASK)

